# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html
# Carlos Castillo

In [5]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
# from pandas.tools.plotting import radviz

%matplotlib inline

In [8]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23],'c':[16,17,18]}))
print (mi_df)

    a   b   c
0  11  21  16
1  12  22  17
2  13  23  18

In [9]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1],
       'Numero de cantones':[24,10,18]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  zona  Numero de cantones
0       Loja       Loja     7                  24
1  Pichincha      Quito     8                  10
2     Guayas  Guayaquil     1                  18

In [14]:
columnas = ['nombres','apellidos','cedula','ciudad']

In [18]:
lista = [['rene', 'elizalde', '11041260','Guayaquil'],
        ['rolando', 'solano', '11041261','Cuenca'],
        ['Carlos','Castillo','11027212','Loja'],
        ['Luis','Erazo','1102112','Quito'],
        ['Gerson','Santos','12123123','El Oro'],
        ['Carlos','Juca','1231231','El Guabo']]

In [19]:
data = pd.DataFrame(lista, columns=columnas)

In [20]:
data

   nombres apellidos    cedula     ciudad
0     rene  elizalde  11041260  Guayaquil
1  rolando    solano  11041261     Cuenca
2   Carlos  Castillo  11027212       Loja
3     Luis     Erazo   1102112      Quito
4   Gerson    Santos  12123123     El Oro
5   Carlos      Juca   1231231   El Guabo

In [21]:
lista2 = [['rene2', 'elizalde2', '11041263','Guayas'],
        ['rolando2', 'solano2', '11041264','Manabi'],]

In [22]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [23]:
data2

    nombres  apellidos    cedula  ciudad
0     rene2  elizalde2  11041263  Guayas
1  rolando2    solano2  11041264  Manabi

In [24]:
data3 = pd.concat([data, data2])

In [25]:
data3

    nombres  apellidos    cedula     ciudad
0      rene   elizalde  11041260  Guayaquil
1   rolando     solano  11041261     Cuenca
2    Carlos   Castillo  11027212       Loja
3      Luis      Erazo   1102112      Quito
4    Gerson     Santos  12123123     El Oro
5    Carlos       Juca   1231231   El Guabo
0     rene2  elizalde2  11041263     Guayas
1  rolando2    solano2  11041264     Manabi

In [28]:
data4 = pd.DataFrame({'Nombre':['Carlos','Luis','Gerson','Homer'],
                     'Apellido':['Castillo','Erazo','Santos','Juca'],
                     'cedula':['11041260', '11041261', '11041263', '11041266']})

In [29]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [20]:
data5

      Ciudad  Provincia    cedula
0  Guayaquil     Guayas  11041260
1     Cuenca      Azuay  11041261
2      Quito  Pichincha  11041263
3       Loja       Loja  11041266

In [30]:
result = pd.merge(data4, data5, on='cedula')

In [31]:
result

   Nombre  Apellido    cedula     Ciudad  Provincia
0  Carlos  Castillo  11041260  Guayaquil     Guayas
1    Luis     Erazo  11041261     Cuenca      Azuay
2  Gerson    Santos  11041263      Quito  Pichincha
3   Homer      Juca  11041266       Loja       Loja

In [18]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

      Ciudad  Provincia    cedula
0  Guayaquil     Guayas  11041260
1     Cuenca      Azuay  11041261
2      Quito  Pichincha  11041263